-- Book data
INSERT INTO Book (id, definition, title) VALUES
	 (1, ' دليل شامل حول السيرة النبوية، يقدم فيه ابن القيم توجيهات مستخلصة من حياة النبي محمد ﷺ. يدمج الكتاب بين الفقه، العقيدة، والسلوك..','زاد المعاد في هدي خير العباد'),
	 (2, 'رحلة روحية للمؤمن في طريقه إلى الله، مع شرح مفصل للمنازل الروحية التي يجب أن يمر بها.  الكتاب شرح لكتاب "منازل السائرين" للهروي، يركز على الإخلاص والتوكل والتوبة كعناصر أساسية في العبادة.','مدارج السالكين بين منازل إياك نعبد وإياك نستعين'),
	 (3, 'علم الفتوى وأصول الفقه. يتحدث عن القواعد الشرعية التي يجب أن يتبعها الفقيه عند إصدار الفتوى، ويناقش الأخطاء الشائعة في الاجتهاد.
','إعلام الموقعين عن رب العالمين'),
	 (4, 'معالجة الأمراض النفسية والروحية.
يتناول الكتاب أسباب الوقوع في المعاصي وآثارها على الفرد والمجتمع، ويصف وسائل التخلص منها والتوبة.','الجواب الكافي لمن سأل عن الدواء الشافي (المعروف أيضًا بـ"الداء والدواء")'),
	 (5, ' الحب ومفهومه في الإسلام.
يناقش الحب المشروع وغير المشروع، مع نصائح لتنظيم المشاعر وضبطها وفق القيم الإسلامية.','روضة المحبين ونزهة المشتاقين'),
	 (6, 'الهجرة إلى الله ورسوله.
يوضح كيفية ترك العادات السيئة والهجرة إلى الأعمال الصالحة والتقرب من الله.','طريق الهجرتين وباب السعادتين'),
	 (7, 'أحكام التعامل مع غير المسلمين في الدولة الإسلامية.
يناقش القواعد الشرعية المتعلقة بأهل الذمة وأسلوب التعامل معهم في إطار الشريعة.','أحكام أهل الذمة'),
	 (8, 'يناقش ماهية الروح، علاقتها بالجسد، وأحوالها بعد الموت.','الروح وحقيقتها.'),
	 (9, 'مفاتيح السعادة الحقيقية في الدنيا والآخرة. يوضح الكتاب أن السعادة تكمن في معرفة الله ومحبته وطاعته، وأن كل سعادة خارج هذا الإطار هي سعادة زائفة ومؤقتة. يقدم مفاتيح عملية لتحقيق السعادة من خلال العلم النافع والعمل الصالح والذكر والعبادة.','مفتاح دار السعادة'),
	 (10, 'كتاب عظيم في مسائل القضاء والقدر والحكمة والتعليل. يرد فيه ابن القيم على الشبهات المتعلقة بالقدر والجبر والاختيار، ويوضح حكمة الله في خلقه وأمره، ويرد على منكري القدر والمعتزلة والجبرية. يبين الكتاب أن الله حكيم في قضائه وقدره، وأن كل ما يحدث في الكون له حكمة بالغة، وأن العبد مسؤول عن اختياره وعمله.','شفاء العليل في مسائل القضاء والقدر والحكمة والتعليل');
